package lesson3.hw;

/**
 * GBJava3
 * Algorithms and data structures in Java. 24.09.2019 Webinar. Teacher: Fanzil' Kusyapkulov
 * Урок 3. Стек и очередь.
 * Обзор структуры данных. Стек, очередь и приоритетная очередь
 * Домашняя работа.
 * 1. Реализовать рассмотренные структуры данных в консольных программах.
 *  a) Добавить в стек увеличение массива при переполнении стека.
 *  б) Добавить в приоритетную очередь оптимизацию при поиске в отсортированном массиве.
 * 2. Создать программу, которая переворачивает вводимые строки (читает справа налево).
 * 3. Создать класс для реализации дека.
 */
public class Less3_hw {
}
